Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/attendance_and_discipline_in_schools/index.html.txt.tmx
Source language: en
Languages: ga

source: Attendance and discipline in schools
ga: Cúrsaí Láithreachais agus smachta sna scoileanna

source: Reporting child abuse at primary and post primary level
ga: Mí-úsáid leanaí a thuairisciú ag leibhéal na bunscoile agus na hiar-bhunscoile

source: Here, we outline the responsibilities and duties of school management and staff in Ireland in reporting child abuse. Information on the legal protection available and your rights
ga: Anseo tugaimid sracléiriú ar fhreagrachtaí agus ar dhualgais bhainistíocht agus fhoireann na scoile in Éirinn maidir le mí-úsáid leanaí a thuairisciú, faisnéis maidir leis an gcosaint dlí atá ar fáil agus maidir le do chearta

source: School terms in primary and post-primary schools
ga: Téarmaí scoile i mbunscoileanna agus iarbhunscoileanna

source: Christmas, Easter and mid-term breaks are standardised in Irish schools
ga: Tá caighdeánú déanta ar scítheanna na Nollag, na Cásca agus ar na scítheanna lárthéarma i scoileanna na hÉireann

source: Information about the length of the school year and holidays at primary and post-primary level
ga: Eolas faoi fhad na scoilbhliana agus laethanta saoire ag an mbunleibhéal agus an dara leibhéal

source: The Education Welfare Act (2000) obliges the Boards of Management of schools to have a code of behaviour about school discipline
ga: Cuireann an tAcht um Leas Oideachais (2000) dualgas ar Bhoird Bhainistíochta na scoileanna cód iompraíochta a bheith acu maidir le smacht scoile

source: Home School Community Liaison Scheme
ga: An Scéim Caidrimh Baile- Scoile

source: The Home School Community Liaison Scheme is targeted at children in Ireland who are at risk of not reaching their educational potential
ga: Tá cur síos anseo ar an scéim Caidrimh Baile- Scoile atá dírithe ar phaistí go bhfuil baol ann nach ndéanfaidís dul chun cinn de réir a gcumais i gcúrsaí oideachais

source: The law in Ireland sets down a minimum age for leaving school. Information on the rules governing school attendance, rule enforcement and home education rights
ga: Cuntas faoi na rialacha maidir le tinreamh scoile, tinreamh scoile, cur i bhfeidhm rialacha agus pionós, agus cearta oideachais-bhaile

source: Bullying in schools is a serious problem and it is the responsibility of school managements to deal with it
ga: Is mór an fhadhb í an bhulaíocht i scoileanna agus tá dualgas ar údaráis bhainistíochta na scoileanna déileáil leí

source: Most Read in "Education and Training"
ga: Ábhar is mó éilimh i "Oideachas agus Oiliúint"

source: Further Education and Training (FET) allowances
ga: Liúntais Bhreisoideachais agus Oiliúna (BOO)
